Repository: samuelmtds/genesis
Catalog: genesis/modules/i18n/pt_BR/omegat/project_save.tmx
Source language: en_us
Languages: pt_br

source: Malformed Criteria annotation
pt_br: Anotação Criteria mal formada

source: Malformed Criteria annotation: order-by clause must be ''asc'' or ''desc''
pt_br: Anotação Criteria mal formada: cláusula order-by deve conter ''asc'' ou ''desc''

source: NoSuchObjectException occured
pt_br: Ocorreu uma NoSuchObjectException

source: Retrying on NoSuchObjectException...
pt_br: Tentando novamente devido a NoSuchObjectException...

source: RemoteException occured
pt_br: Ocorreu uma RemoteException

source: An error ocurred while removing EJB instance
pt_br: Ocorreu um erro durante remoção da instância do EJB

source: Error preloading SessionFactory
pt_br: Erro durante pré-carregamento da SessionFactory

source: WorkerThreadDisposed interrupted
pt_br: WorkerThreadDisposed interrompida

source: New thread created: {0}
pt_br: Nova thread criada: {0}

source: Reusing thread: {0}
pt_br: Reutilizando thread: {0}

source: Execution took more than {0,number} ms
pt_br: A execução levou mais que {0,number} ms

source: Invalid argument: {0}
pt_br: Argumento inválido: {0}

source: {0} is not an enum
pt_br: {0} não é uma enum

source: list cannot be null
pt_br: A lista não pode ser nula

source: A null propertiesMap was found while trying to build a CriteriaCommandExecutor; perhaps you forgot to call CriteriaPropertyHelper.fillCriteria(command, form)?
pt_br: Um propertiesMap nulo foi encontrado durante a tentativa de criar um CriteriaCommandExecutor; talvez você tenha esquecido de chamar CriteriaPropertyHelper.fillCriteria(command, form)?

source: {0} has no metadata registered; you probably need to instantiate a binder for it before calling this method
pt_br: Nenhum metadado registrado para {0}; você provavelmente precisa instanciar um binder para {0} antes de chamar o método

source: {0} has no controller registered; you probably need to instantiate a binder for it before calling this method
pt_br: Nenhum controller registrado para {0}; você provavelmente precisa instanciar um binder para {0} antes de chamar o método

source: Form controller has not been setup
pt_br: O método setup do controller do form não foi chamado

source: {0} is already present in the script context; try to use a different alias at the constructor
pt_br: {0} já esta presente no contexto do script; tente utilizar um alias diferente no construtor

source: Storing properties {0} for later execution
pt_br: Armazenando propriedades {0} para execução posterior

source: Bean called ''{0}'' not found
pt_br: Bean chamado ''{0}'' não encontrado

source: Bean named {0}: {1}
pt_br: O bean chamado {0}: {1}

source: Malformed expression ''{0}''
pt_br: Expressão ''{0}'' mal formada

source: object ''{0}'' not in registry
pt_br: O objeto ''{0}'' não está no registro

source: function {0} not found.
pt_br: Função {0} não encontrada.

source: Internal Error: {0}
pt_br: Erro interno: {0}

source: JavaScript Error: {0}
pt_br: Erro de JavaScript: {0}

source: {0} cannot be converted to {1}; its type is {2}
pt_br: {0} não pode ser convertido para {1}; seu tipo é {2}

source: No such variable: ''{0}''
pt_br: Variável ''{0}'' inexistente

source: Simultaneous operations: should not request pointer list while iterating over an EvalContext
pt_br: Operações simultâneas: não é possível requisitar a lista de ponteiros enquanto iterando um EvalContext

source: {0} is not a valid value for axis
pt_br: {0} não é um valor válido para um axis

source: The ''messages.properties'' file was not found in classpath.
pt_br: O arquivo ''messages.properties'' não foi encontrado no classpath.

source: Unexpected error occurred
pt_br: Ocorreu um erro inesperado

source: Error
pt_br: Erro

source: Component {0} is already bound
pt_br: O binding para o componente gráfico {0} já foi realizado

source: setup() has already been called
pt_br: setup() já foi chamado

source: @DataProvider {0} in {1} returned null; it should return an empty {2} instead
pt_br: O @DataProvider {0} em {1} retornou um valor nulo; um {2} vazio deve ser retornado no lugar deste

source: Cannot invoke null action
pt_br: Não é possível chamar uma ação nula

source: Couldn''t find action named {0}
pt_br: Não foi possível encontrar uma ação chamada {0}

source: There is already no previous state
pt_br: Estado anterior não disponível

source: {0} is not supported for data providing
pt_br: @DataProvider não suportado para {0}

source: Property ''{0}'' for the widget named {1} must either be left empty or contain a boolean value
pt_br: A propriedade ''{0}'' para o componente gráfico chamado {1} deve ser deixada em branco ou conter um valor booleano

source: Screen not found: {0}
pt_br: Tela não encontrada: {0}

source: The widget named ''{0}'' expected {1} to have a property named ''{2}'' (at bean {3})
pt_br: O componente gráfico chamado ''{0}'' espera que {1} tenha uma propriedade chamada ''{2}'' (no bean {3})

source: column (index {0,number}; text: {1}) in table {2} does not have a name
pt_br: A coluna (índice {0,number}; texto: {1}) na tabela {2} não tem um nome definido

source: There is no formatter registered for virtual property {0}.{1}
pt_br: Não há um formatador registrado para a propriedade virtual {0}.{1}

source: No form is currently bound to desktop
pt_br: Nenhum binding entre form e o desktop foi realizado até o momento

source: More than one form is bound to desktop
pt_br: Mais de um form já realizou binding com o desktop

source: {0} is not bound
pt_br: O binding não foi realizado para {0}

source: No form is currently bound to widget
pt_br: Nenhum binding entre form e o componente gráfico foi realizado até o momento

source: Group property must be a comma-separated string, array of strings, a collection of widgets, an array of widgets or a Widget
pt_br: Uma propriedade de grupo deve ser uma string separada por vírgula, um array de strings, uma coleção de componentes gráficos, um array de componentes gráficos ou um componente gráfico

source: Length of selected indexes must be one of less
pt_br: A quantidade dos índices selecionados deve ser um ou menos

source: Argument is not an array or a java.util.List
pt_br: O argumento não é um array nem uma java.util.List

source: Cannot retrieve model index ({0,number})
pt_br: Não pôde recuperar o índice do modelo ({0,number})

source: Column number {0,number} from Table {1} does not have an identifier
pt_br: A coluna número {0,number} da tabela {1} não tem um identificador

source: Method ''{0}'' is a @DataProvider and does not have an Object array or java.util.List as its return type
pt_br: O método ''{0}'' é um @DataProvider e não tem como retorno um array de Object ou java.util.List

source: An @Action/@DataProvider cannot have the same name of a property: {0}
pt_br: Uma @Action/@DataProvider não pode ter o mesmo nome de uma propriedade: {0}

source: {0} cannot be used in a method with parameters: {1}
pt_br: {0} não pode ser utilizado em um método com parâmetros: {1}

source: ( at member {0}:{1} )
pt_br: ( no membro {0}:{1} )

source: ( at {0}.{1}({2}) )
pt_br: ( em {0}.{1}({2}) )

source: {0} cannot be used as a form annotation ( at {1} )
pt_br: {0} não pode ser utilizada como uma anotação de um form ( em {1} )

source: {0} cannot be used to annotate a property {1}
pt_br: {0} não pode ser utilizada para anotar uma propriedade {1}

source: {0} cannot be used to annotate a property; maybe removing the get prefix from the method will fix it {1}
pt_br: {0} não pode ser utilizada para anotar uma propriedade; talvez removendo o prefixo get do método resolverá o problema {1}

source: {0} cannot be used to annotate a method {1}
pt_br: {0} não pode ser utilizada para anotar um método {1}

source: {0} must be used with a method annotated with @Action {1}
pt_br: {0} deve ser utilizada com um método anotado com @Action {1}

source: {0} must be used either with a getter or a method annotated with @DataProvider {1}
pt_br: {0} deve ser utilizado com um getter ou um método anotado com @DataProvider {1}

source: {0} must be used either with a getter or a method annotated with @Action {1}
pt_br: {0} deve ser utilizado com um getter ou um método anotado com @Action {1}

source: At least one of widgetName, objectField or indexField must be specified for @DataProvider {0}
pt_br: Pelo menos widgetName, objectField ou indexField deve ser especificado para um @DataProvider {0}

source: @DataProvider objectField refers to ''{0}'', but such a public property does not exist; maybe creating public <type> get{1}() and public void set{1}(<type> var) will fix it {2}
pt_br: O objectField do @DataProvider refere-se a ''{0}'', mas tal propriedade pública não existe; talvez criando public <type> get{1}() e public void set{1}(<type> var) resolverá o problema {2}

source: @DataProvider objectField refers to ''{0}'', but it is not a read-write property; maybe creating public <type> get{1}() and public void set{1}(<type> var) will fix it {2}
pt_br: O objectField do @DataProvider refere-se a ''{0}'', mas esta não é uma propriedade de escrita-leitura; talvez criando public <type> get{1}() e public void set{1}(<type> var) resolverá o problema {2}

source: @DataProvider objectField refers to ''{0}'', but it cannot be a primitive or an array of primitives {1}
pt_br: O objectField do @DataProvider refere-se a ''{0}'', mas este não pode ser um primitivo ou um array de primitivos {1}

source: @DataProvider indexField refers to ''{0}'', but such a public property does not exist; maybe creating public <type> get{1}() and public void set{1}(<type> var) will fix it {2}
pt_br: O indexField do @DataProvider refere-se a ''{0}'', mas tal propriedade pública não existe; talvez criando public <type> get{1}() e public void set{1}(<type> var) resolverá o problema {2}

source: @DataProvider indexField refers to ''{0}'', but it is not a read-write property; maybe creating public <type> get{1}() and public void set{1}(<type> var) will fix it {2}
pt_br: O indexField do @DataProvider refere-se a ''{0}'', mas esta não é uma propriedade de escrita-leitura; talvez criando public <type> get{1}() e public void set{1}(<type> var) resolverá o problema {2}

source: @DataProvider indexField refers to ''{0}'', but it is not an Integer, int, array of the previous types nor a java.util.Collection {1}
pt_br: O indexField do @DataProvider refere-se a ''{0}'', mas este não é um Integer, int, array dos tipos citados anteriormente nem mesmo uma java.util.Collection {1}

source: @VisibleWhen must define at least one script condition {0}
pt_br: @VisibleWhen deve definir pelo menos uma condição de script {0}

source: @VisibleWhen must define at least one script condition or pairs of script conditions {0}
pt_br: @VisibleWhen deve definir pelo menos uma, ou pares de condições de script {0}

source: Unknown exception
pt_br: Exceção desconhecida

source: Could not find a suitable JTableIndexResolver implementation for {0}, component {1}.
pt_br: Não foi possível encontrar uma implementação adequada de JTableIndexResolver para {0}, componente gráfico {1}.

source: Component {0} is a single selection list.
pt_br: O componente gráfico {0} é uma lista de seleção simples

source: It can''t be updated with indexes {1}
pt_br: e não pode ser atualizado com os índices {1}

source: Cannot update {0} component with multiple values because it''s a single selection list.
pt_br: Não é possível atualizar o componente gráfico {0} com múltiplos valores pois este é uma lista de seleção simples.

source: The component named ''{0}'' was expected {1} to have a property named ''{2}'' (at bean {3})
pt_br: O componente gráfico chamado ''{0}'' espera que {1} tenha uma propriedade chamada ''{2}'' (no bean {3})

source: Key produced for {0} in {1} using value {2} was null
pt_br: A chave produzida para {0} em {1} utilizando o valor {2} foi nula

source: No selected value configured for button {0}.
pt_br: Nenhum valor de seleção configurado para o botão {0}.

source: Use button.setActionCommand(\"someValue\") to define its value.
pt_br: Utilize botao.setActionCommand(\"algumValor\") para definir este valor.

source: Use button.putClientProperty(SwingBinder.BUTTON_GROUP_SELECTION_VALUE, someValue) or button.setName(someValue) to define its value.
pt_br: Utilize botao.putClientProperty(SwingBinder.BUTTON_GROUP_SELECTION_VALUE, algumValor) ou botao.setName(algumValor) para definir este valor.

source: Group property must be a comma-separated string, array of strings, a collection of components, an array of components or a JComponent
pt_br: Uma propriedade de grupo deve ser uma string separada por vírgula, um array de strings, uma coleção de componentes gráficos, um array de componentes gráficos ou um componente gráfico

source: Property ''{0}'' for the component named {1} must either be left empty or contain a boolean value
pt_br: A propriedade ''{0}'' para o componente gráfico chamado {1} deve ser deixada em branco ou conter um valor booleano

source: Error removing listener
pt_br: Erro removendo listener

source: Could not load convertRowIndexTo* methods
pt_br: Não pôde carregar os métodos convertRowIndexTo*

source: Column identifiers and names must have same length
pt_br: Identificadores e nomes de colunas devem conter a mesma quantidade de itens

source: Column identifiers and preferred widths must have same length
pt_br: Identificadores e larguras pré-definidas de colunas devem conter a mesma quantidade de itens

source: Column identifiers and renderers must have same length
pt_br: Identificadores e renderisadores de colunas devem conter a mesma quantidade de itens

source: component must not be null
pt_br: componente não pode ser nulo

source: Column identifiers and Column names must have same length
pt_br: Identificadores e nomes de colunas devem conter a mesma quantidade de itens

source: Column identifier and Column preferred width must have same length
pt_br: Identificadores e nomes de colunas devem conter a mesma quantidade de itens
